Terraform plan result:

```
data.aws_s3_bucket.lambda_code: Reading...
aws_cloudwatch_log_group.image_processor_logs: Refreshing state... [id=/aws/lambda/emenu-image-processor-dev]
aws_iam_role.appsync_lambda_role: Refreshing state... [id=appsync-lambda-invoke-role]
aws_ssm_parameter.db_connect_string_param: Refreshing state... [id=/emenu/dev/db_connection_string]
aws_iam_role.image_processor_role: Refreshing state... [id=image-processor-role-dev]
aws_iam_role.presigned_url_role: Refreshing state... [id=presigned-url-role-dev]
aws_iam_role.cognito_trigger: Refreshing state... [id=emenu_cognito_post_confirmation_role]
aws_cloudwatch_log_group.presigned_url_generator_logs: Refreshing state... [id=/aws/lambda/emenu-presigned-url-generator-dev]
aws_iam_role.lambda_exec: Refreshing state... [id=emenu_lambda_exec_role]
aws_s3_bucket.restaurant_assets: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket.dish_images: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role_policy_attachment.cognito_lambda_execution: Refreshing state... [id=emenu_cognito_post_confirmation_role-20250929095628385500000001]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=emenu_lambda_exec_role-20250929095628385500000002]
aws_iam_role_policy.emenu_server_ses_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ses_access]
data.aws_s3_bucket.lambda_code: Read complete after 1s [id=emenu-lambda-code-bucket]
data.aws_s3_object.layer_code: Reading...
data.aws_s3_object.emenu_post_confirmation_code: Reading...
data.aws_s3_object.emenu_server_code: Reading...
data.aws_s3_object.presigned_url_generator_code: Reading...
data.aws_s3_object.image_processor_code: Reading...
aws_iam_role_policy.emenu_server_ssm_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ssm_access]
aws_iam_role_policy.emenu_post_confirmation_ssm_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:emenu_post_confirmation_ssm_access]
data.aws_s3_object.layer_code: Read complete after 0s [id=emenu-lambda-code-bucket/layers/common_models/common_models_layer.zip]
aws_lambda_layer_version.common_mongoose_models: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:37]
data.aws_s3_object.emenu_server_code: Read complete after 0s [id=emenu-lambda-code-bucket/lambdas/emenu_server/emenu_server.zip]
data.aws_s3_object.presigned_url_generator_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/presigned_url_generator/presigned_url_generator.zip]
data.aws_s3_object.image_processor_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/image_processor/image_processor.zip]
data.aws_s3_object.emenu_post_confirmation_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/emenu_post_confirmation/emenu_post_confirmation.zip]
aws_lambda_function.emenu_post_confirmation: Refreshing state... [id=emenu_post_confirmation]
aws_cognito_user_pool.emenu_user_pool: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ]
aws_s3_bucket_versioning.restaurant_assets_versioning: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_server_side_encryption_configuration.restaurant_assets_encryption: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_public_access_block.restaurant_assets_pab: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_cors_configuration.restaurant_assets_cors: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role_policy.presigned_url_policy: Refreshing state... [id=presigned-url-role-dev:presigned-url-policy-dev]
aws_s3_bucket_server_side_encryption_configuration.dish_images_encryption: Refreshing state... [id=emenu-dish-images-dev]
aws_s3_bucket_versioning.dish_images_versioning: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role_policy.image_processor_policy: Refreshing state... [id=image-processor-role-dev:image-processor-policy-dev]
aws_s3_bucket_cors_configuration.dish_images_cors: Refreshing state... [id=emenu-dish-images-dev]
aws_s3_bucket_public_access_block.dish_images_pab: Refreshing state... [id=emenu-dish-images-dev]
aws_lambda_function.image_processor: Refreshing state... [id=emenu-image-processor-dev]
aws_lambda_function.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_s3_bucket_policy.restaurant_assets_policy: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_cognito_user_group.demo_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/demo]
aws_iam_role_policy.emenu_server_cognito_admin_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_cognito_admin_access]
aws_cognito_user_group.waiter_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/waiter]
aws_lambda_permission.allow_cognito_user_pool: Refreshing state... [id=AllowExecutionFromCognitoUserPool]
aws_appsync_graphql_api.emenu_apis: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy]
aws_lambda_function.emenu_server: Refreshing state... [id=emenu-server]
aws_iam_role_policy.cognito_admin_group_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:AllowCognitoAdminGroupAccess]
aws_cognito_user_pool_client.emenu_app_client: Refreshing state... [id=19kbapekjfmn2jkue74baferh5]
aws_cognito_user_pool_client.emenu_web_client: Refreshing state... [id=4l90vqi7nfam318ci1tml91j3n]
aws_s3_bucket_policy.dish_images_policy: Refreshing state... [id=emenu-dish-images-dev]
aws_cognito_user_group.boss_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/boss]
aws_lambda_permission.allow_s3_invoke_dish_images: Refreshing state... [id=AllowExecutionFromDishImagesBucket]
aws_lambda_permission.allow_s3_invoke: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_lambda_function_url.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_s3_bucket_notification.dish_image_upload_notification: Refreshing state... [id=emenu-dish-images-dev]
aws_s3_bucket_notification.image_upload_notification: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role_policy.appsync_invoke_lambda: Refreshing state... [id=appsync-lambda-invoke-role:appsync-invoke-lambda]
aws_appsync_api_key.emenu_api_key: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4]
aws_appsync_datasource.emenu_datasource: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-emenu_datasource]
aws_appsync_resolver.update_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDish]
aws_appsync_resolver.get_restaurant_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getRestaurant]
aws_appsync_resolver.list_dish_types_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishTypes]
aws_appsync_resolver.dish_dishType_field: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Dish-dishType]
aws_appsync_resolver.update_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDishType]
aws_appsync_resolver.update_restaurant_info_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantInfo]
aws_appsync_resolver.delete_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDish]
aws_appsync_resolver.invite_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-inviteWaiter]
aws_appsync_resolver.get_user_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUser]
aws_appsync_resolver.create_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDishType]
aws_appsync_resolver.create_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDish]
aws_appsync_resolver.list_waiters_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listWaiters]
aws_appsync_resolver.update_restaurant_subscription_plan_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantSubscriptionPlan]
aws_appsync_resolver.toggle_dish_type_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishTypeStatus]
aws_appsync_resolver.delete_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDishType]
aws_appsync_resolver.list_orders_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listOrders]
aws_appsync_resolver.register_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-registerWaiter]
aws_appsync_resolver.list_dishes_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishes]
aws_appsync_resolver.toggle_dish_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishStatus]
aws_appsync_resolver.get_user_by_cognito_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUserByCognito]
aws_appsync_resolver.create_restaurant_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createRestaurant]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appsync_api_key.emenu_api_key will be updated in-place
  ~ resource "aws_appsync_api_key" "emenu_api_key" {
      ~ expires     = "2027-02-22T03:00:00Z" -> (known after apply)
        id          = "lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4"
        # (4 unchanged attributes hidden)
    }

  # aws_appsync_resolver.cancel_order_item_mutation will be created
  + resource "aws_appsync_resolver" "cancel_order_item_mutation" {
      + api_id            = "lwxrbthg3naonl3t7x5bydvhhy"
      + arn               = (known after apply)
      + data_source       = "emenu_datasource"
      + field             = "cancelOrderItem"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<-EOT
            {
              "version": "2018-05-29",
              "operation": "Invoke",
              "payload": {
                "fieldName": "cancelOrderItem",
                "arguments": $util.toJson($arguments),
                "identity": $util.toJson($context.identity)
              }
            }
        EOT
      + response_template = <<-EOT
            #if($ctx.error)
              $utils.error($ctx.error.message, $ctx.error.type)
            #end
            $utils.toJson($ctx.result)
        EOT
      + type              = "Mutation"
    }

  # aws_appsync_resolver.cancel_order_mutation will be created
  + resource "aws_appsync_resolver" "cancel_order_mutation" {
      + api_id            = "lwxrbthg3naonl3t7x5bydvhhy"
      + arn               = (known after apply)
      + data_source       = "emenu_datasource"
      + field             = "cancelOrder"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<-EOT
            {
              "version": "2018-05-29",
              "operation": "Invoke",
              "payload": {
                "fieldName": "cancelOrder",
                "arguments": $util.toJson($arguments),
                "identity": $util.toJson($context.identity)
              }
            }
        EOT
      + response_template = <<-EOT
            #if($ctx.error)
              $utils.error($ctx.error.message, $ctx.error.type)
            #end
            $utils.toJson($ctx.result)
        EOT
      + type              = "Mutation"
    }

  # aws_appsync_resolver.confirm_order_items_mutation will be created
  + resource "aws_appsync_resolver" "confirm_order_items_mutation" {
      + api_id            = "lwxrbthg3naonl3t7x5bydvhhy"
      + arn               = (known after apply)
      + data_source       = "emenu_datasource"
      + field             = "confirmOrderItems"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<-EOT
            {
              "version": "2018-05-29",
              "operation": "Invoke",
              "payload": {
                "fieldName": "confirmOrderItems",
                "arguments": $util.toJson($arguments),
                "identity": $util.toJson($context.identity)
              }
            }
        EOT
      + response_template = <<-EOT
            #if($ctx.error)
              $utils.error($ctx.error.message, $ctx.error.type)
            #end
            $utils.toJson($ctx.result)
        EOT
      + type              = "Mutation"
    }

  # aws_appsync_resolver.pay_order_mutation will be created
  + resource "aws_appsync_resolver" "pay_order_mutation" {
      + api_id            = "lwxrbthg3naonl3t7x5bydvhhy"
      + arn               = (known after apply)
      + data_source       = "emenu_datasource"
      + field             = "payOrder"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<-EOT
            {
              "version": "2018-05-29",
              "operation": "Invoke",
              "payload": {
                "fieldName": "payOrder",
                "arguments": $util.toJson($arguments),
                "identity": $util.toJson($context.identity)
              }
            }
        EOT
      + response_template = <<-EOT
            #if($ctx.error)
              $utils.error($ctx.error.message, $ctx.error.type)
            #end
            $utils.toJson($ctx.result)
        EOT
      + type              = "Mutation"
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

Please approve to proceed.
